docs/phase-5-results/load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/scenarios/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m0s max duration (incl. graceful stop):
              * load: Up to 50 looping VUs for 4m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 00/50 VUs, 0 complete and 0 interrupted iterations
load   [   0% ] 00/50 VUs  0m01.0s/4m30.0s

running (0m02.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
load   [   1% ] 01/50 VUs  0m02.0s/4m30.0s

running (0m03.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
load   [   1% ] 02/50 VUs  0m03.0s/4m30.0s

running (0m04.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
load   [   1% ] 03/50 VUs  0m04.0s/4m30.0s

running (0m05.0s), 04/50 VUs, 6 complete and 0 interrupted iterations
load   [   2% ] 04/50 VUs  0m05.0s/4m30.0s

running (0m06.0s), 04/50 VUs, 10 complete and 0 interrupted iterations
load   [   2% ] 04/50 VUs  0m06.0s/4m30.0s

running (0m07.0s), 05/50 VUs, 14 complete and 0 interrupted iterations
load   [   3% ] 05/50 VUs  0m07.0s/4m30.0s

running (0m08.0s), 06/50 VUs, 19 complete and 0 interrupted iterations
load   [   3% ] 06/50 VUs  0m08.0s/4m30.0s

running (0m09.0s), 07/50 VUs, 25 complete and 0 interrupted iterations
load   [   3% ] 07/50 VUs  0m09.0s/4m30.0s

running (0m10.0s), 08/50 VUs, 32 complete and 0 interrupted iterations
load   [   4% ] 08/50 VUs  0m10.0s/4m30.0s

running (0m11.0s), 09/50 VUs, 40 complete and 0 interrupted iterations
load   [   4% ] 09/50 VUs  0m11.0s/4m30.0s

running (0m12.0s), 09/50 VUs, 49 complete and 0 interrupted iterations
load   [   4% ] 09/50 VUs  0m12.0s/4m30.0s

running (0m13.0s), 10/50 VUs, 58 complete and 0 interrupted iterations
load   [   5% ] 10/50 VUs  0m13.0s/4m30.0s

running (0m14.0s), 11/50 VUs, 68 complete and 0 interrupted iterations
load   [   5% ] 11/50 VUs  0m14.0s/4m30.0s

running (0m15.0s), 12/50 VUs, 79 complete and 0 interrupted iterations
load   [   6% ] 12/50 VUs  0m15.0s/4m30.0s

running (0m16.0s), 13/50 VUs, 91 complete and 0 interrupted iterations
load   [   6% ] 13/50 VUs  0m16.0s/4m30.0s

running (0m17.0s), 14/50 VUs, 104 complete and 0 interrupted iterations
load   [   6% ] 14/50 VUs  0m17.0s/4m30.0s

running (0m18.0s), 14/50 VUs, 118 complete and 0 interrupted iterations
load   [   7% ] 14/50 VUs  0m18.0s/4m30.0s

running (0m19.0s), 15/50 VUs, 132 complete and 0 interrupted iterations
load   [   7% ] 15/50 VUs  0m19.0s/4m30.0s

running (0m20.0s), 16/50 VUs, 147 complete and 0 interrupted iterations
load   [   7% ] 16/50 VUs  0m20.0s/4m30.0s

running (0m21.0s), 17/50 VUs, 162 complete and 0 interrupted iterations
load   [   8% ] 17/50 VUs  0m21.0s/4m30.0s

running (0m22.0s), 18/50 VUs, 179 complete and 0 interrupted iterations
load   [   8% ] 18/50 VUs  0m22.0s/4m30.0s

running (0m23.0s), 19/50 VUs, 196 complete and 0 interrupted iterations
load   [   9% ] 19/50 VUs  0m23.0s/4m30.0s

running (0m24.0s), 19/50 VUs, 214 complete and 0 interrupted iterations
load   [   9% ] 19/50 VUs  0m24.0s/4m30.0s

running (0m25.0s), 20/50 VUs, 233 complete and 0 interrupted iterations
load   [   9% ] 20/50 VUs  0m25.0s/4m30.0s

running (0m26.0s), 21/50 VUs, 253 complete and 0 interrupted iterations
load   [  10% ] 21/50 VUs  0m26.0s/4m30.0s

running (0m27.0s), 22/50 VUs, 274 complete and 0 interrupted iterations
load   [  10% ] 22/50 VUs  0m27.0s/4m30.0s

running (0m28.0s), 23/50 VUs, 296 complete and 0 interrupted iterations
load   [  10% ] 23/50 VUs  0m28.0s/4m30.0s

running (0m29.0s), 24/50 VUs, 319 complete and 0 interrupted iterations
load   [  11% ] 24/50 VUs  0m29.0s/4m30.0s

running (0m30.0s), 24/50 VUs, 343 complete and 0 interrupted iterations
load   [  11% ] 24/50 VUs  0m30.0s/4m30.0s

running (0m31.0s), 25/50 VUs, 367 complete and 0 interrupted iterations
load   [  11% ] 25/50 VUs  0m31.0s/4m30.0s

running (0m32.0s), 26/50 VUs, 391 complete and 0 interrupted iterations
load   [  12% ] 26/50 VUs  0m32.0s/4m30.0s

running (0m33.0s), 27/50 VUs, 417 complete and 0 interrupted iterations
load   [  12% ] 27/50 VUs  0m33.0s/4m30.0s

running (0m34.0s), 28/50 VUs, 444 complete and 0 interrupted iterations
load   [  13% ] 28/50 VUs  0m34.0s/4m30.0s

running (0m35.0s), 29/50 VUs, 472 complete and 0 interrupted iterations
load   [  13% ] 29/50 VUs  0m35.0s/4m30.0s

running (0m36.0s), 29/50 VUs, 501 complete and 0 interrupted iterations
load   [  13% ] 29/50 VUs  0m36.0s/4m30.0s

running (0m37.0s), 30/50 VUs, 530 complete and 0 interrupted iterations
load   [  14% ] 30/50 VUs  0m37.0s/4m30.0s

running (0m38.0s), 31/50 VUs, 559 complete and 0 interrupted iterations
load   [  14% ] 31/50 VUs  0m38.0s/4m30.0s

running (0m39.0s), 32/50 VUs, 590 complete and 0 interrupted iterations
load   [  14% ] 32/50 VUs  0m39.0s/4m30.0s

running (0m40.0s), 33/50 VUs, 620 complete and 0 interrupted iterations
load   [  15% ] 33/50 VUs  0m40.0s/4m30.0s

running (0m41.0s), 34/50 VUs, 653 complete and 0 interrupted iterations
load   [  15% ] 34/50 VUs  0m41.0s/4m30.0s

running (0m42.0s), 34/50 VUs, 686 complete and 0 interrupted iterations
load   [  16% ] 34/50 VUs  0m42.0s/4m30.0s

running (0m43.0s), 35/50 VUs, 720 complete and 0 interrupted iterations
load   [  16% ] 35/50 VUs  0m43.0s/4m30.0s

running (0m44.0s), 36/50 VUs, 755 complete and 0 interrupted iterations
load   [  16% ] 36/50 VUs  0m44.0s/4m30.0s

running (0m45.0s), 37/50 VUs, 791 complete and 0 interrupted iterations
load   [  17% ] 37/50 VUs  0m45.0s/4m30.0s

running (0m46.0s), 38/50 VUs, 828 complete and 0 interrupted iterations
load   [  17% ] 38/50 VUs  0m46.0s/4m30.0s

running (0m47.0s), 39/50 VUs, 866 complete and 0 interrupted iterations
load   [  17% ] 39/50 VUs  0m47.0s/4m30.0s

running (0m48.0s), 39/50 VUs, 905 complete and 0 interrupted iterations
load   [  18% ] 39/50 VUs  0m48.0s/4m30.0s

running (0m49.0s), 40/50 VUs, 944 complete and 0 interrupted iterations
load   [  18% ] 40/50 VUs  0m49.0s/4m30.0s

running (0m50.0s), 41/50 VUs, 984 complete and 0 interrupted iterations
load   [  19% ] 41/50 VUs  0m50.0s/4m30.0s

running (0m51.0s), 42/50 VUs, 1025 complete and 0 interrupted iterations
load   [  19% ] 42/50 VUs  0m51.0s/4m30.0s

running (0m52.0s), 43/50 VUs, 1067 complete and 0 interrupted iterations
load   [  19% ] 43/50 VUs  0m52.0s/4m30.0s

running (0m53.0s), 44/50 VUs, 1110 complete and 0 interrupted iterations
load   [  20% ] 44/50 VUs  0m53.0s/4m30.0s

running (0m54.0s), 44/50 VUs, 1154 complete and 0 interrupted iterations
load   [  20% ] 44/50 VUs  0m54.0s/4m30.0s

running (0m55.0s), 45/50 VUs, 1198 complete and 0 interrupted iterations
load   [  20% ] 45/50 VUs  0m55.0s/4m30.0s

running (0m56.0s), 46/50 VUs, 1243 complete and 0 interrupted iterations
load   [  21% ] 46/50 VUs  0m56.0s/4m30.0s

running (0m57.0s), 47/50 VUs, 1289 complete and 0 interrupted iterations
load   [  21% ] 47/50 VUs  0m57.0s/4m30.0s

running (0m58.0s), 48/50 VUs, 1334 complete and 0 interrupted iterations
load   [  21% ] 48/50 VUs  0m58.0s/4m30.0s

running (0m59.0s), 49/50 VUs, 1380 complete and 0 interrupted iterations
load   [  22% ] 49/50 VUs  0m59.0s/4m30.0s

running (1m00.0s), 49/50 VUs, 1428 complete and 0 interrupted iterations
load   [  22% ] 49/50 VUs  1m00.0s/4m30.0s

running (1m01.0s), 50/50 VUs, 1477 complete and 0 interrupted iterations
load   [  23% ] 50/50 VUs  1m01.0s/4m30.0s

running (1m02.0s), 50/50 VUs, 1526 complete and 0 interrupted iterations
load   [  23% ] 50/50 VUs  1m02.0s/4m30.0s

running (1m03.0s), 50/50 VUs, 1574 complete and 0 interrupted iterations
load   [  23% ] 50/50 VUs  1m03.0s/4m30.0s

running (1m04.0s), 50/50 VUs, 1623 complete and 0 interrupted iterations
load   [  24% ] 50/50 VUs  1m04.0s/4m30.0s

running (1m05.0s), 50/50 VUs, 1673 complete and 0 interrupted iterations
load   [  24% ] 50/50 VUs  1m05.0s/4m30.0s

running (1m06.0s), 50/50 VUs, 1723 complete and 0 interrupted iterations
load   [  24% ] 50/50 VUs  1m06.0s/4m30.0s

running (1m07.0s), 50/50 VUs, 1773 complete and 0 interrupted iterations
load   [  25% ] 50/50 VUs  1m07.0s/4m30.0s

running (1m08.0s), 50/50 VUs, 1823 complete and 0 interrupted iterations
load   [  25% ] 50/50 VUs  1m08.0s/4m30.0s

running (1m09.0s), 50/50 VUs, 1871 complete and 0 interrupted iterations
load   [  26% ] 50/50 VUs  1m09.0s/4m30.0s

running (1m10.0s), 50/50 VUs, 1921 complete and 0 interrupted iterations
load   [  26% ] 50/50 VUs  1m10.0s/4m30.0s

running (1m11.0s), 50/50 VUs, 1971 complete and 0 interrupted iterations
load   [  26% ] 50/50 VUs  1m11.0s/4m30.0s

running (1m12.0s), 50/50 VUs, 2021 complete and 0 interrupted iterations
load   [  27% ] 50/50 VUs  1m12.0s/4m30.0s

running (1m13.0s), 50/50 VUs, 2071 complete and 0 interrupted iterations
load   [  27% ] 50/50 VUs  1m13.0s/4m30.0s

running (1m14.0s), 50/50 VUs, 2121 complete and 0 interrupted iterations
load   [  27% ] 50/50 VUs  1m14.0s/4m30.0s

running (1m15.0s), 50/50 VUs, 2169 complete and 0 interrupted iterations
load   [  28% ] 50/50 VUs  1m15.0s/4m30.0s

running (1m16.0s), 50/50 VUs, 2219 complete and 0 interrupted iterations
load   [  28% ] 50/50 VUs  1m16.0s/4m30.0s

running (1m17.0s), 50/50 VUs, 2269 complete and 0 interrupted iterations
load   [  29% ] 50/50 VUs  1m17.0s/4m30.0s

running (1m18.0s), 50/50 VUs, 2319 complete and 0 interrupted iterations
load   [  29% ] 50/50 VUs  1m18.0s/4m30.0s

running (1m19.0s), 50/50 VUs, 2369 complete and 0 interrupted iterations
load   [  29% ] 50/50 VUs  1m19.0s/4m30.0s

running (1m20.0s), 50/50 VUs, 2418 complete and 0 interrupted iterations
load   [  30% ] 50/50 VUs  1m20.0s/4m30.0s

running (1m21.0s), 50/50 VUs, 2467 complete and 0 interrupted iterations
load   [  30% ] 50/50 VUs  1m21.0s/4m30.0s

running (1m22.0s), 50/50 VUs, 2517 complete and 0 interrupted iterations
load   [  30% ] 50/50 VUs  1m22.0s/4m30.0s

running (1m23.0s), 50/50 VUs, 2566 complete and 0 interrupted iterations
load   [  31% ] 50/50 VUs  1m23.0s/4m30.0s

running (1m24.0s), 50/50 VUs, 2616 complete and 0 interrupted iterations
load   [  31% ] 50/50 VUs  1m24.0s/4m30.0s

running (1m25.0s), 50/50 VUs, 2666 complete and 0 interrupted iterations
load   [  31% ] 50/50 VUs  1m25.0s/4m30.0s

running (1m26.0s), 50/50 VUs, 2716 complete and 0 interrupted iterations
load   [  32% ] 50/50 VUs  1m26.0s/4m30.0s

running (1m27.0s), 50/50 VUs, 2766 complete and 0 interrupted iterations
load   [  32% ] 50/50 VUs  1m27.0s/4m30.0s

running (1m28.0s), 50/50 VUs, 2816 complete and 0 interrupted iterations
load   [  33% ] 50/50 VUs  1m28.0s/4m30.0s

running (1m29.0s), 50/50 VUs, 2866 complete and 0 interrupted iterations
load   [  33% ] 50/50 VUs  1m29.0s/4m30.0s

running (1m30.0s), 50/50 VUs, 2914 complete and 0 interrupted iterations
load   [  33% ] 50/50 VUs  1m30.0s/4m30.0s

running (1m31.0s), 50/50 VUs, 2961 complete and 0 interrupted iterations
load   [  34% ] 50/50 VUs  1m31.0s/4m30.0s

running (1m32.0s), 50/50 VUs, 3011 complete and 0 interrupted iterations
load   [  34% ] 50/50 VUs  1m32.0s/4m30.0s

running (1m33.0s), 50/50 VUs, 3060 complete and 0 interrupted iterations
load   [  34% ] 50/50 VUs  1m33.0s/4m30.0s

running (1m34.0s), 50/50 VUs, 3109 complete and 0 interrupted iterations
load   [  35% ] 50/50 VUs  1m34.0s/4m30.0s

running (1m35.0s), 50/50 VUs, 3159 complete and 0 interrupted iterations
load   [  35% ] 50/50 VUs  1m35.0s/4m30.0s

running (1m36.0s), 50/50 VUs, 3209 complete and 0 interrupted iterations
load   [  36% ] 50/50 VUs  1m36.0s/4m30.0s

running (1m37.0s), 50/50 VUs, 3259 complete and 0 interrupted iterations
load   [  36% ] 50/50 VUs  1m37.0s/4m30.0s

running (1m38.0s), 50/50 VUs, 3309 complete and 0 interrupted iterations
load   [  36% ] 50/50 VUs  1m38.0s/4m30.0s

running (1m39.0s), 50/50 VUs, 3359 complete and 0 interrupted iterations
load   [  37% ] 50/50 VUs  1m39.0s/4m30.0s

running (1m40.0s), 50/50 VUs, 3409 complete and 0 interrupted iterations
load   [  37% ] 50/50 VUs  1m40.0s/4m30.0s

running (1m41.0s), 50/50 VUs, 3459 complete and 0 interrupted iterations
load   [  37% ] 50/50 VUs  1m41.0s/4m30.0s

running (1m42.0s), 50/50 VUs, 3509 complete and 0 interrupted iterations
load   [  38% ] 50/50 VUs  1m42.0s/4m30.0s

running (1m43.0s), 50/50 VUs, 3557 complete and 0 interrupted iterations
load   [  38% ] 50/50 VUs  1m43.0s/4m30.0s

running (1m44.0s), 50/50 VUs, 3605 complete and 0 interrupted iterations
load   [  39% ] 50/50 VUs  1m44.0s/4m30.0s

running (1m45.0s), 50/50 VUs, 3655 complete and 0 interrupted iterations
load   [  39% ] 50/50 VUs  1m45.0s/4m30.0s

running (1m46.0s), 50/50 VUs, 3705 complete and 0 interrupted iterations
load   [  39% ] 50/50 VUs  1m46.0s/4m30.0s

running (1m47.0s), 50/50 VUs, 3755 complete and 0 interrupted iterations
load   [  40% ] 50/50 VUs  1m47.0s/4m30.0s

running (1m48.0s), 50/50 VUs, 3804 complete and 0 interrupted iterations
load   [  40% ] 50/50 VUs  1m48.0s/4m30.0s

running (1m49.0s), 50/50 VUs, 3854 complete and 0 interrupted iterations
load   [  40% ] 50/50 VUs  1m49.0s/4m30.0s

running (1m50.0s), 50/50 VUs, 3903 complete and 0 interrupted iterations
load   [  41% ] 50/50 VUs  1m50.0s/4m30.0s

running (1m51.0s), 50/50 VUs, 3953 complete and 0 interrupted iterations
load   [  41% ] 50/50 VUs  1m51.0s/4m30.0s

running (1m52.0s), 50/50 VUs, 4002 complete and 0 interrupted iterations
load   [  41% ] 50/50 VUs  1m52.0s/4m30.0s

running (1m53.0s), 50/50 VUs, 4050 complete and 0 interrupted iterations
load   [  42% ] 50/50 VUs  1m53.0s/4m30.0s

running (1m54.0s), 50/50 VUs, 4100 complete and 0 interrupted iterations
load   [  42% ] 50/50 VUs  1m54.0s/4m30.0s

running (1m55.0s), 50/50 VUs, 4150 complete and 0 interrupted iterations
load   [  43% ] 50/50 VUs  1m55.0s/4m30.0s

running (1m56.0s), 50/50 VUs, 4200 complete and 0 interrupted iterations
load   [  43% ] 50/50 VUs  1m56.0s/4m30.0s

running (1m57.0s), 50/50 VUs, 4250 complete and 0 interrupted iterations
load   [  43% ] 50/50 VUs  1m57.0s/4m30.0s

running (1m58.0s), 50/50 VUs, 4300 complete and 0 interrupted iterations
load   [  44% ] 50/50 VUs  1m58.0s/4m30.0s

running (1m59.0s), 50/50 VUs, 4350 complete and 0 interrupted iterations
load   [  44% ] 50/50 VUs  1m59.0s/4m30.0s

running (2m00.0s), 50/50 VUs, 4400 complete and 0 interrupted iterations
load   [  44% ] 50/50 VUs  2m00.0s/4m30.0s

running (2m01.0s), 50/50 VUs, 4450 complete and 0 interrupted iterations
load   [  45% ] 50/50 VUs  2m01.0s/4m30.0s

running (2m02.0s), 50/50 VUs, 4500 complete and 0 interrupted iterations
load   [  45% ] 50/50 VUs  2m02.0s/4m30.0s

running (2m03.0s), 50/50 VUs, 4550 complete and 0 interrupted iterations
load   [  46% ] 50/50 VUs  2m03.0s/4m30.0s

running (2m04.0s), 50/50 VUs, 4600 complete and 0 interrupted iterations
load   [  46% ] 50/50 VUs  2m04.0s/4m30.0s

running (2m05.0s), 50/50 VUs, 4650 complete and 0 interrupted iterations
load   [  46% ] 50/50 VUs  2m05.0s/4m30.0s

running (2m06.0s), 50/50 VUs, 4700 complete and 0 interrupted iterations
load   [  47% ] 50/50 VUs  2m06.0s/4m30.0s

running (2m07.0s), 50/50 VUs, 4750 complete and 0 interrupted iterations
load   [  47% ] 50/50 VUs  2m07.0s/4m30.0s

running (2m08.0s), 50/50 VUs, 4800 complete and 0 interrupted iterations
load   [  47% ] 50/50 VUs  2m08.0s/4m30.0s

running (2m09.0s), 50/50 VUs, 4850 complete and 0 interrupted iterations
load   [  48% ] 50/50 VUs  2m09.0s/4m30.0s

running (2m10.0s), 50/50 VUs, 4900 complete and 0 interrupted iterations
load   [  48% ] 50/50 VUs  2m10.0s/4m30.0s

running (2m11.0s), 50/50 VUs, 4950 complete and 0 interrupted iterations
load   [  49% ] 50/50 VUs  2m11.0s/4m30.0s

running (2m12.0s), 50/50 VUs, 5000 complete and 0 interrupted iterations
load   [  49% ] 50/50 VUs  2m12.0s/4m30.0s

running (2m13.0s), 50/50 VUs, 5050 complete and 0 interrupted iterations
load   [  49% ] 50/50 VUs  2m13.0s/4m30.0s

running (2m14.0s), 50/50 VUs, 5100 complete and 0 interrupted iterations
load   [  50% ] 50/50 VUs  2m14.0s/4m30.0s

running (2m15.0s), 50/50 VUs, 5150 complete and 0 interrupted iterations
load   [  50% ] 50/50 VUs  2m15.0s/4m30.0s

running (2m16.0s), 50/50 VUs, 5198 complete and 0 interrupted iterations
load   [  50% ] 50/50 VUs  2m16.0s/4m30.0s

running (2m17.0s), 50/50 VUs, 5248 complete and 0 interrupted iterations
load   [  51% ] 50/50 VUs  2m17.0s/4m30.0s

running (2m18.0s), 50/50 VUs, 5298 complete and 0 interrupted iterations
load   [  51% ] 50/50 VUs  2m18.0s/4m30.0s

running (2m19.0s), 50/50 VUs, 5348 complete and 0 interrupted iterations
load   [  51% ] 50/50 VUs  2m19.0s/4m30.0s

running (2m20.0s), 50/50 VUs, 5397 complete and 0 interrupted iterations
load   [  52% ] 50/50 VUs  2m20.0s/4m30.0s

running (2m21.0s), 50/50 VUs, 5441 complete and 0 interrupted iterations
load   [  52% ] 50/50 VUs  2m21.0s/4m30.0s

running (2m22.0s), 50/50 VUs, 5491 complete and 0 interrupted iterations
load   [  53% ] 50/50 VUs  2m22.0s/4m30.0s

running (2m23.0s), 50/50 VUs, 5541 complete and 0 interrupted iterations
load   [  53% ] 50/50 VUs  2m23.0s/4m30.0s

running (2m24.0s), 50/50 VUs, 5591 complete and 0 interrupted iterations
load   [  53% ] 50/50 VUs  2m24.0s/4m30.0s

running (2m25.0s), 50/50 VUs, 5641 complete and 0 interrupted iterations
load   [  54% ] 50/50 VUs  2m25.0s/4m30.0s

running (2m26.0s), 50/50 VUs, 5691 complete and 0 interrupted iterations
load   [  54% ] 50/50 VUs  2m26.0s/4m30.0s

running (2m27.0s), 50/50 VUs, 5741 complete and 0 interrupted iterations
load   [  54% ] 50/50 VUs  2m27.0s/4m30.0s

running (2m28.0s), 50/50 VUs, 5791 complete and 0 interrupted iterations
load   [  55% ] 50/50 VUs  2m28.0s/4m30.0s

running (2m29.0s), 50/50 VUs, 5841 complete and 0 interrupted iterations
load   [  55% ] 50/50 VUs  2m29.0s/4m30.0s

running (2m30.0s), 50/50 VUs, 5889 complete and 0 interrupted iterations
load   [  56% ] 50/50 VUs  2m30.0s/4m30.0s

running (2m31.0s), 50/50 VUs, 5938 complete and 0 interrupted iterations
load   [  56% ] 50/50 VUs  2m31.0s/4m30.0s

running (2m32.0s), 50/50 VUs, 5984 complete and 0 interrupted iterations
load   [  56% ] 50/50 VUs  2m32.0s/4m30.0s

running (2m33.0s), 50/50 VUs, 6034 complete and 0 interrupted iterations
load   [  57% ] 50/50 VUs  2m33.0s/4m30.0s

running (2m34.0s), 50/50 VUs, 6084 complete and 0 interrupted iterations
load   [  57% ] 50/50 VUs  2m34.0s/4m30.0s

running (2m35.0s), 50/50 VUs, 6134 complete and 0 interrupted iterations
load   [  57% ] 50/50 VUs  2m35.0s/4m30.0s

running (2m36.0s), 50/50 VUs, 6184 complete and 0 interrupted iterations
load   [  58% ] 50/50 VUs  2m36.0s/4m30.0s

running (2m37.0s), 50/50 VUs, 6234 complete and 0 interrupted iterations
load   [  58% ] 50/50 VUs  2m37.0s/4m30.0s

running (2m38.0s), 50/50 VUs, 6284 complete and 0 interrupted iterations
load   [  59% ] 50/50 VUs  2m38.0s/4m30.0s

running (2m39.0s), 50/50 VUs, 6334 complete and 0 interrupted iterations
load   [  59% ] 50/50 VUs  2m39.0s/4m30.0s

running (2m40.0s), 50/50 VUs, 6384 complete and 0 interrupted iterations
load   [  59% ] 50/50 VUs  2m40.0s/4m30.0s

running (2m41.0s), 50/50 VUs, 6434 complete and 0 interrupted iterations
load   [  60% ] 50/50 VUs  2m41.0s/4m30.0s

running (2m42.0s), 50/50 VUs, 6484 complete and 0 interrupted iterations
load   [  60% ] 50/50 VUs  2m42.0s/4m30.0s

running (2m43.0s), 50/50 VUs, 6534 complete and 0 interrupted iterations
load   [  60% ] 50/50 VUs  2m43.0s/4m30.0s

running (2m44.0s), 50/50 VUs, 6584 complete and 0 interrupted iterations
load   [  61% ] 50/50 VUs  2m44.0s/4m30.0s

running (2m45.0s), 50/50 VUs, 6634 complete and 0 interrupted iterations
load   [  61% ] 50/50 VUs  2m45.0s/4m30.0s

running (2m46.0s), 50/50 VUs, 6684 complete and 0 interrupted iterations
load   [  61% ] 50/50 VUs  2m46.0s/4m30.0s

running (2m47.0s), 50/50 VUs, 6734 complete and 0 interrupted iterations
load   [  62% ] 50/50 VUs  2m47.0s/4m30.0s

running (2m48.0s), 50/50 VUs, 6784 complete and 0 interrupted iterations
load   [  62% ] 50/50 VUs  2m48.0s/4m30.0s

running (2m49.0s), 50/50 VUs, 6834 complete and 0 interrupted iterations
load   [  63% ] 50/50 VUs  2m49.0s/4m30.0s

running (2m50.0s), 50/50 VUs, 6884 complete and 0 interrupted iterations
load   [  63% ] 50/50 VUs  2m50.0s/4m30.0s

running (2m51.0s), 50/50 VUs, 6934 complete and 0 interrupted iterations
load   [  63% ] 50/50 VUs  2m51.0s/4m30.0s

running (2m52.0s), 50/50 VUs, 6984 complete and 0 interrupted iterations
load   [  64% ] 50/50 VUs  2m52.0s/4m30.0s

running (2m53.0s), 50/50 VUs, 7034 complete and 0 interrupted iterations
load   [  64% ] 50/50 VUs  2m53.0s/4m30.0s

running (2m54.0s), 50/50 VUs, 7084 complete and 0 interrupted iterations
load   [  64% ] 50/50 VUs  2m54.0s/4m30.0s

running (2m55.0s), 50/50 VUs, 7134 complete and 0 interrupted iterations
load   [  65% ] 50/50 VUs  2m55.0s/4m30.0s

running (2m56.0s), 50/50 VUs, 7184 complete and 0 interrupted iterations
load   [  65% ] 50/50 VUs  2m56.0s/4m30.0s

running (2m57.0s), 50/50 VUs, 7233 complete and 0 interrupted iterations
load   [  66% ] 50/50 VUs  2m57.0s/4m30.0s

running (2m58.0s), 50/50 VUs, 7283 complete and 0 interrupted iterations
load   [  66% ] 50/50 VUs  2m58.0s/4m30.0s

running (2m59.0s), 50/50 VUs, 7333 complete and 0 interrupted iterations
load   [  66% ] 50/50 VUs  2m59.0s/4m30.0s

running (3m00.0s), 50/50 VUs, 7383 complete and 0 interrupted iterations
load   [  67% ] 50/50 VUs  3m00.0s/4m30.0s

running (3m01.0s), 50/50 VUs, 7433 complete and 0 interrupted iterations
load   [  67% ] 50/50 VUs  3m01.0s/4m30.0s

running (3m02.0s), 50/50 VUs, 7483 complete and 0 interrupted iterations
load   [  67% ] 50/50 VUs  3m02.0s/4m30.0s

running (3m03.0s), 50/50 VUs, 7532 complete and 0 interrupted iterations
load   [  68% ] 50/50 VUs  3m03.0s/4m30.0s

running (3m04.0s), 50/50 VUs, 7574 complete and 0 interrupted iterations
load   [  68% ] 50/50 VUs  3m04.0s/4m30.0s

running (3m05.0s), 50/50 VUs, 7618 complete and 0 interrupted iterations
load   [  69% ] 50/50 VUs  3m05.0s/4m30.0s

running (3m06.0s), 50/50 VUs, 7668 complete and 0 interrupted iterations
load   [  69% ] 50/50 VUs  3m06.0s/4m30.0s

running (3m07.0s), 50/50 VUs, 7718 complete and 0 interrupted iterations
load   [  69% ] 50/50 VUs  3m07.0s/4m30.0s

running (3m08.0s), 50/50 VUs, 7768 complete and 0 interrupted iterations
load   [  70% ] 50/50 VUs  3m08.0s/4m30.0s

running (3m09.0s), 50/50 VUs, 7817 complete and 0 interrupted iterations
load   [  70% ] 50/50 VUs  3m09.0s/4m30.0s

running (3m10.0s), 50/50 VUs, 7867 complete and 0 interrupted iterations
load   [  70% ] 50/50 VUs  3m10.0s/4m30.0s

running (3m11.0s), 50/50 VUs, 7916 complete and 0 interrupted iterations
load   [  71% ] 50/50 VUs  3m11.0s/4m30.0s

running (3m12.0s), 50/50 VUs, 7966 complete and 0 interrupted iterations
load   [  71% ] 50/50 VUs  3m12.0s/4m30.0s

running (3m13.0s), 50/50 VUs, 8016 complete and 0 interrupted iterations
load   [  71% ] 50/50 VUs  3m13.0s/4m30.0s

running (3m14.0s), 50/50 VUs, 8066 complete and 0 interrupted iterations
load   [  72% ] 50/50 VUs  3m14.0s/4m30.0s

running (3m15.0s), 50/50 VUs, 8115 complete and 0 interrupted iterations
load   [  72% ] 50/50 VUs  3m15.0s/4m30.0s

running (3m16.0s), 50/50 VUs, 8165 complete and 0 interrupted iterations
load   [  73% ] 50/50 VUs  3m16.0s/4m30.0s

running (3m17.0s), 50/50 VUs, 8215 complete and 0 interrupted iterations
load   [  73% ] 50/50 VUs  3m17.0s/4m30.0s

running (3m18.0s), 50/50 VUs, 8265 complete and 0 interrupted iterations
load   [  73% ] 50/50 VUs  3m18.0s/4m30.0s

running (3m19.0s), 50/50 VUs, 8315 complete and 0 interrupted iterations
load   [  74% ] 50/50 VUs  3m19.0s/4m30.0s

running (3m20.0s), 50/50 VUs, 8365 complete and 0 interrupted iterations
load   [  74% ] 50/50 VUs  3m20.0s/4m30.0s

running (3m21.0s), 50/50 VUs, 8415 complete and 0 interrupted iterations
load   [  74% ] 50/50 VUs  3m21.0s/4m30.0s

running (3m22.0s), 50/50 VUs, 8465 complete and 0 interrupted iterations
load   [  75% ] 50/50 VUs  3m22.0s/4m30.0s

running (3m23.0s), 50/50 VUs, 8515 complete and 0 interrupted iterations
load   [  75% ] 50/50 VUs  3m23.0s/4m30.0s

running (3m24.0s), 50/50 VUs, 8564 complete and 0 interrupted iterations
load   [  76% ] 50/50 VUs  3m24.0s/4m30.0s

running (3m25.0s), 50/50 VUs, 8613 complete and 0 interrupted iterations
load   [  76% ] 50/50 VUs  3m25.0s/4m30.0s

running (3m26.0s), 50/50 VUs, 8663 complete and 0 interrupted iterations
load   [  76% ] 50/50 VUs  3m26.0s/4m30.0s

running (3m27.0s), 50/50 VUs, 8712 complete and 0 interrupted iterations
load   [  77% ] 50/50 VUs  3m27.0s/4m30.0s

running (3m28.0s), 50/50 VUs, 8762 complete and 0 interrupted iterations
load   [  77% ] 50/50 VUs  3m28.0s/4m30.0s

running (3m29.0s), 50/50 VUs, 8812 complete and 0 interrupted iterations
load   [  77% ] 50/50 VUs  3m29.0s/4m30.0s

running (3m30.0s), 50/50 VUs, 8862 complete and 0 interrupted iterations
load   [  78% ] 50/50 VUs  3m30.0s/4m30.0s

running (3m31.0s), 50/50 VUs, 8910 complete and 0 interrupted iterations
load   [  78% ] 50/50 VUs  3m31.0s/4m30.0s

running (3m32.0s), 50/50 VUs, 8959 complete and 0 interrupted iterations
load   [  79% ] 50/50 VUs  3m32.0s/4m30.0s

running (3m33.0s), 50/50 VUs, 9006 complete and 0 interrupted iterations
load   [  79% ] 50/50 VUs  3m33.0s/4m30.0s

running (3m34.0s), 50/50 VUs, 9052 complete and 0 interrupted iterations
load   [  79% ] 50/50 VUs  3m34.0s/4m30.0s

running (3m35.0s), 50/50 VUs, 9100 complete and 0 interrupted iterations
load   [  80% ] 50/50 VUs  3m35.0s/4m30.0s

running (3m36.0s), 50/50 VUs, 9150 complete and 0 interrupted iterations
load   [  80% ] 50/50 VUs  3m36.0s/4m30.0s

running (3m37.0s), 50/50 VUs, 9200 complete and 0 interrupted iterations
load   [  80% ] 50/50 VUs  3m37.0s/4m30.0s

running (3m38.0s), 50/50 VUs, 9250 complete and 0 interrupted iterations
load   [  81% ] 50/50 VUs  3m38.0s/4m30.0s

running (3m39.0s), 50/50 VUs, 9300 complete and 0 interrupted iterations
load   [  81% ] 50/50 VUs  3m39.0s/4m30.0s

running (3m40.0s), 50/50 VUs, 9350 complete and 0 interrupted iterations
load   [  81% ] 50/50 VUs  3m40.0s/4m30.0s

running (3m41.0s), 50/50 VUs, 9400 complete and 0 interrupted iterations
load   [  82% ] 50/50 VUs  3m41.0s/4m30.0s

running (3m42.0s), 50/50 VUs, 9450 complete and 0 interrupted iterations
load   [  82% ] 50/50 VUs  3m42.0s/4m30.0s

running (3m43.0s), 50/50 VUs, 9500 complete and 0 interrupted iterations
load   [  83% ] 50/50 VUs  3m43.0s/4m30.0s

running (3m44.0s), 50/50 VUs, 9550 complete and 0 interrupted iterations
load   [  83% ] 50/50 VUs  3m44.0s/4m30.0s

running (3m45.0s), 50/50 VUs, 9600 complete and 0 interrupted iterations
load   [  83% ] 50/50 VUs  3m45.0s/4m30.0s

running (3m46.0s), 50/50 VUs, 9650 complete and 0 interrupted iterations
load   [  84% ] 50/50 VUs  3m46.0s/4m30.0s

running (3m47.0s), 50/50 VUs, 9700 complete and 0 interrupted iterations
load   [  84% ] 50/50 VUs  3m47.0s/4m30.0s

running (3m48.0s), 50/50 VUs, 9750 complete and 0 interrupted iterations
load   [  84% ] 50/50 VUs  3m48.0s/4m30.0s

running (3m49.0s), 50/50 VUs, 9800 complete and 0 interrupted iterations
load   [  85% ] 50/50 VUs  3m49.0s/4m30.0s

running (3m50.0s), 50/50 VUs, 9850 complete and 0 interrupted iterations
load   [  85% ] 50/50 VUs  3m50.0s/4m30.0s

running (3m51.0s), 50/50 VUs, 9900 complete and 0 interrupted iterations
load   [  86% ] 50/50 VUs  3m51.0s/4m30.0s

running (3m52.0s), 50/50 VUs, 9950 complete and 0 interrupted iterations
load   [  86% ] 50/50 VUs  3m52.0s/4m30.0s

running (3m53.0s), 50/50 VUs, 10000 complete and 0 interrupted iterations
load   [  86% ] 50/50 VUs  3m53.0s/4m30.0s

running (3m54.0s), 50/50 VUs, 10050 complete and 0 interrupted iterations
load   [  87% ] 50/50 VUs  3m54.0s/4m30.0s

running (3m55.0s), 50/50 VUs, 10100 complete and 0 interrupted iterations
load   [  87% ] 50/50 VUs  3m55.0s/4m30.0s

running (3m56.0s), 50/50 VUs, 10150 complete and 0 interrupted iterations
load   [  87% ] 50/50 VUs  3m56.0s/4m30.0s

running (3m57.0s), 50/50 VUs, 10200 complete and 0 interrupted iterations
load   [  88% ] 50/50 VUs  3m57.0s/4m30.0s

running (3m58.0s), 50/50 VUs, 10250 complete and 0 interrupted iterations
load   [  88% ] 50/50 VUs  3m58.0s/4m30.0s

running (3m59.0s), 50/50 VUs, 10300 complete and 0 interrupted iterations
load   [  89% ] 50/50 VUs  3m59.0s/4m30.0s

running (4m00.0s), 50/50 VUs, 10350 complete and 0 interrupted iterations
load   [  89% ] 50/50 VUs  4m00.0s/4m30.0s

running (4m01.0s), 50/50 VUs, 10400 complete and 0 interrupted iterations
load   [  89% ] 50/50 VUs  4m01.0s/4m30.0s

running (4m02.0s), 48/50 VUs, 10450 complete and 0 interrupted iterations
load   [  90% ] 48/50 VUs  4m02.0s/4m30.0s

running (4m03.0s), 47/50 VUs, 10498 complete and 0 interrupted iterations
load   [  90% ] 47/50 VUs  4m03.0s/4m30.0s

running (4m04.0s), 44/50 VUs, 10545 complete and 0 interrupted iterations
load   [  90% ] 44/50 VUs  4m04.0s/4m30.0s

running (4m05.0s), 43/50 VUs, 10589 complete and 0 interrupted iterations
load   [  91% ] 43/50 VUs  4m05.0s/4m30.0s

running (4m06.0s), 42/50 VUs, 10632 complete and 0 interrupted iterations
load   [  91% ] 42/50 VUs  4m06.0s/4m30.0s

running (4m07.0s), 39/50 VUs, 10674 complete and 0 interrupted iterations
load   [  91% ] 39/50 VUs  4m07.0s/4m30.0s

running (4m08.0s), 38/50 VUs, 10713 complete and 0 interrupted iterations
load   [  92% ] 38/50 VUs  4m08.0s/4m30.0s

running (4m09.0s), 37/50 VUs, 10751 complete and 0 interrupted iterations
load   [  92% ] 37/50 VUs  4m09.0s/4m30.0s

running (4m10.0s), 34/50 VUs, 10788 complete and 0 interrupted iterations
load   [  93% ] 34/50 VUs  4m10.0s/4m30.0s

running (4m11.0s), 33/50 VUs, 10822 complete and 0 interrupted iterations
load   [  93% ] 33/50 VUs  4m11.0s/4m30.0s

running (4m12.0s), 32/50 VUs, 10855 complete and 0 interrupted iterations
load   [  93% ] 32/50 VUs  4m12.0s/4m30.0s

running (4m13.0s), 29/50 VUs, 10887 complete and 0 interrupted iterations
load   [  94% ] 29/50 VUs  4m13.0s/4m30.0s

running (4m14.0s), 28/50 VUs, 10916 complete and 0 interrupted iterations
load   [  94% ] 28/50 VUs  4m14.0s/4m30.0s

running (4m15.0s), 26/50 VUs, 10944 complete and 0 interrupted iterations
load   [  94% ] 26/50 VUs  4m15.0s/4m30.0s

running (4m16.0s), 24/50 VUs, 10968 complete and 0 interrupted iterations
load   [  95% ] 24/50 VUs  4m16.0s/4m30.0s

running (4m17.0s), 23/50 VUs, 10987 complete and 0 interrupted iterations
load   [  95% ] 23/50 VUs  4m17.0s/4m30.0s

running (4m18.0s), 21/50 VUs, 11010 complete and 0 interrupted iterations
load   [  96% ] 21/50 VUs  4m18.0s/4m30.0s

running (4m19.0s), 20/50 VUs, 11030 complete and 0 interrupted iterations
load   [  96% ] 20/50 VUs  4m19.0s/4m30.0s

running (4m20.0s), 19/50 VUs, 11050 complete and 0 interrupted iterations
load   [  96% ] 19/50 VUs  4m20.0s/4m30.0s

running (4m21.0s), 16/50 VUs, 11069 complete and 0 interrupted iterations
load   [  97% ] 16/50 VUs  4m21.0s/4m30.0s

running (4m22.0s), 15/50 VUs, 11085 complete and 0 interrupted iterations
load   [  97% ] 15/50 VUs  4m22.0s/4m30.0s

running (4m23.0s), 14/50 VUs, 11100 complete and 0 interrupted iterations
load   [  97% ] 14/50 VUs  4m23.0s/4m30.0s

running (4m24.0s), 11/50 VUs, 11114 complete and 0 interrupted iterations
load   [  98% ] 11/50 VUs  4m24.0s/4m30.0s

running (4m25.0s), 10/50 VUs, 11125 complete and 0 interrupted iterations
load   [  98% ] 10/50 VUs  4m25.0s/4m30.0s

running (4m26.0s), 09/50 VUs, 11135 complete and 0 interrupted iterations
load   [  99% ] 09/50 VUs  4m26.0s/4m30.0s

running (4m27.0s), 06/50 VUs, 11144 complete and 0 interrupted iterations
load   [  99% ] 06/50 VUs  4m27.0s/4m30.0s

running (4m28.0s), 05/50 VUs, 11150 complete and 0 interrupted iterations
load   [  99% ] 05/50 VUs  4m28.0s/4m30.0s

running (4m29.0s), 04/50 VUs, 11155 complete and 0 interrupted iterations
load   [ 100% ] 04/50 VUs  4m29.0s/4m30.0s

running (4m30.0s), 02/50 VUs, 11159 complete and 0 interrupted iterations
load   [ 100% ] 02/50 VUs  4m30.0s/4m30.0s


  █ THRESHOLDS 

    browse_duration
    ✓ 'p(95)<500' p(95)=7.54ms

    http_req_duration
    ✓ 'p(99)<2000' p(99)=28.19ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    order_create_duration
    ✓ 'p(95)<1500' p(95)=30.2ms


  █ TOTAL RESULTS 

    checks_total.......: 17792   65.70402/s
    checks_succeeded...: 100.00% 17792 out of 17792
    checks_failed......: 0.00%   0 out of 17792

    ✓ order health 200
    ✓ browse list 200
    ✓ browse detail 200 or 404
    ✓ order create 201
    ✓ payment health 200

    CUSTOM
    browse_duration................: avg=3.83ms  min=1.52ms  med=3.25ms max=30.6ms  p(90)=6.18ms  p(95)=7.54ms 
    order_create_duration..........: avg=19.72ms min=11.59ms med=18.1ms max=98.23ms p(90)=27.09ms p(95)=30.2ms 

    HTTP
    http_req_duration..............: avg=5.52ms  min=405µs   med=3.26ms max=98.23ms p(90)=15.64ms p(95)=19.51ms
      { expected_response:true }...: avg=5.52ms  min=405µs   med=3.26ms max=98.23ms p(90)=15.64ms p(95)=19.51ms
    http_req_failed................: 0.00%  0 out of 17792
    http_reqs......................: 17792  65.70402/s

    EXECUTION
    iteration_duration.............: avg=1s      min=1s      med=1s     max=1.09s   p(90)=1.01s   p(95)=1.02s  
    iterations.....................: 11161  41.216421/s
    vus............................: 2      min=0          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 35 MB  130 kB/s
    data_sent......................: 2.4 MB 8.7 kB/s



running (4m30.8s), 00/50 VUs, 11161 complete and 0 interrupted iterations
load ✓ [ 100% ] 00/50 VUs  4m30s